rel/overlay/doc/Documentation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-03-03 07:48:51 EST"/>
<meta name="author" content="Rusty Klophaus"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Documentation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Summary </a></li>
<li><a href="#sec-2">2 Common Questions </a>
<ul>
<li><a href="#sec-2.1">2.1 How do I start/stop/manage Nitrogen? </a></li>
<li><a href="#sec-2.2">2.2 Where is the code for my website? </a></li>
<li><a href="#sec-2.3">2.3 How do I create new pages, custom elements, or custom actions? </a></li>
<li><a href="#sec-2.4">2.4 How do I compile my code? </a></li>
<li><a href="#sec-2.5">2.5 How do I change configuration settings? </a></li>
<li><a href="#sec-2.6">2.6 How do I upgrade to a new version of Nitrogen? </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Resources </a></li>
<li><a href="#sec-4">4 Versions </a></li>
<li><a href="#sec-5">5 Thanks </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary </h2>
<div class="outline-text-2" id="text-1">


<p>
The purpose of this document is to help you get up and hacking
quickly on a new Nitrogen-based website. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Common Questions </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> How do I start/stop/manage Nitrogen? </h3>
<div class="outline-text-3" id="text-2.1">


<p>
To start Nitrogen, run:
</p>
<pre class="example">
./bin/nitrogen start
</pre>


<p>
The <code>./bin/nitrogen</code> script takes the following commands:
</p>
<ul>
<li>
<code>start</code> - Start Nitrogen.
</li>
<li>
<code>console</code> - Start Nitrogen in console mode.
</li>
<li>
<code>attach</code> - Attach to a running instance of Nitrogen.
</li>
<li>
<code>stop</code>  - Stop Nitrogen
</li>
<li>
<code>restart</code> - Relaunches Nitrogen inside of the Erlang VM.
</li>
<li>
<code>reboot</code> - Cleanly shuts down the Erlang VM, and relaunches if
'heart' is running.
</li>
<li>
<code>ping</code> - Check if this version of Nitrogen is running.

</li>
</ul>

<p>By default, Nitrogen starts on port 8000. You can access your
running Nitrogen server by navigating to <a href="http://localhost:8000">http://localhost:8000</a>. You
should see the startup page.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Where is the code for my website? </h3>
<div class="outline-text-3" id="text-2.2">


<p>
The Nitrogen project is structured so that all site specific code is
inside the <code>site</code> directory. This allows you to put the entire
<code>site</code> directory under source control, for easy development and
deployment.
</p>
<ul>
<li>
<code>./site/src</code> - Page modules, custom elements, and custom actions for
your site.
</li>
<li>
<code>./site/static</code> - Static files, including Javascript and
CSS. These will be served through the web.
</li>
<li>
<code>./site/templates</code> - Html files used by the <code>#template{}</code> action.
</li>
<li>
<code>./site/.prototypes</code> - Code used by <code>./bin/dev</code> to generate a page,
element, or action.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> How do I create new pages, custom elements, or custom actions? </h3>
<div class="outline-text-3" id="text-2.3">


<p>
Nitrogen includes a developer tool to help you get started with a
bare-bones page, element, or action.
</p>
<ul>
<li>
To create a new page at <a href="http://localhost/user/login">http://localhost/user/login</a>, run:

<pre class="example">
./bin/dev page user_login
</pre>


</li>
<li>
To create a new element called <code>#custom_element{}</code>, run:

<pre class="example">
./bin/dev element custom_element
</pre>


</li>
<li>
To create a new action called <code>#custom_action{}</code>, run:

<pre class="example">
./bin/dev action custom_action
</pre>


</li>
</ul>

<p>The code is placed under <code>./site/src</code>, <code>./site/src/elements</code>, or
<code>./site/src/actions</code> for pages, elements, and actions,
respectively. You can modify the code from which the new page,
element, or action is derived by editing the files in
<code>./site/.prototypes/</code>.
</p>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> How do I compile my code? </h3>
<div class="outline-text-3" id="text-2.4">


<p>
Nitrogen provides three ways to compile code. Most often, you will
want to compile without restarting Erlang. To do this, run:
</p>
<pre class="example">
./bin/dev compile
</pre>


<p>
You can also run <code>sync:go()</code> on the Erlang shell.
</p>
<p>
Alternatively, you can run <code>make</code>, but this will require you to
restart Erlang before the changes will take effect.
</p>
</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> How do I change configuration settings? </h3>
<div class="outline-text-3" id="text-2.5">


<p>
By default, Nitrogen starts on port 8000 and listens on all IP
addresses pointing to your computer. You can change this by editing
the files within <code>./etc</code>. 
</p>
<p>
Note that the actual file to edit depends upon which web server you
are running, but if you learned Erlang, you are probably smart
enough to figure it out.
</p>
</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> How do I upgrade to a new version of Nitrogen? </h3>
<div class="outline-text-3" id="text-2.6">


<p>
Assuming there are no API level changes that require you to change
your existing code, you can upgrade Nitrogen as follows:
</p>
<ul>
<li>
Build or download the new Nitrogen environment for your
architecture and preferred web server. Unzip to a new directory.

</li>
<li>
Copy the entire <code>./site</code> directory to the new version, <b>except</b> for
the files in <code>./site/static/nitrogen</code>.

</li>
<li>
Copy the entire <code>./etc</code> directory to the new version.

</li>
</ul>

<p>This will update the Erlang version, the dependencies files, and
all of the Javascript used by Nitrogen. Note that this applies from
Nitrogen version 2.0 onward.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resources </h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>
NitrogenProject.com - <a href="http://nitrogenproject.com">http://nitrogenproject.com</a>

</li>
<li>
Source Code - <a href="http://github.com/rklophaus/nitrogen">http://github.com/rklophaus/nitrogen</a>

</li>
<li>
Donations - <a href="http://pledgie.com/campaigns/2057">http://pledgie.com/campaigns/2057</a>

</li>
<li>
Mailing List - <a href="http://groups.google.com/group/nitrogenweb">http://groups.google.com/group/nitrogenweb</a>

</li>
<li>
Bugs and Issues - <a href="http://nitrogen.lighthouseapp.com">http://nitrogen.lighthouseapp.com</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Versions </h2>
<div class="outline-text-2" id="text-4">


<p>
Nitrogen relies on some or all of the following software:
</p>
<ul>
<li>
<b>Erlang R13B03</b> or later - <a href="http://erlang.org">http://erlang.org</a>

</li>
<li>
<b>SimpleBridge</b> - Common interface to Erlang HTTP servers.
<ul>
<li>
Git Repo: git://github.com/rklophaus/SimpleBridge.git
</li>
<li>
Commit:   652a3d1

</li>
</ul>
</li>
<li>
<b>mochiweb</b> - HTTP Server (Optional)
<ul>
<li>
SVN Repo: <a href="http://mochiweb.googlecode.com/svn/trunk/">http://mochiweb.googlecode.com/svn/trunk/</a>
</li>
<li>
Revision: 133

</li>
</ul>
</li>
<li>
<b>yaws</b> - HTTP Server - <a href="http://yaws.hyber.org/">http://yaws.hyber.org/</a> (Optional)
<ul>
<li>
Source: <a href="http://yaws.hyber.org/download/yaws-1.87.tar.gz">http://yaws.hyber.org/download/yaws-1.87.tar.gz</a>

</li>
</ul>
</li>
<li>
<b>JQuery 1.4.2</b> - <a href="http://jquery.com">http://jquery.com</a>

</li>
<li>
<b>JQuery UI 1.8rc2</b> - <a href="http://jqueryui.com">http://jqueryui.com</a>

</li>
<li>
<b>Live Validation 1.3</b> - <a href="http://livevalidation.com/">http://livevalidation.com/</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Thanks </h2>
<div class="outline-text-2" id="text-5">


<p>
Sincere thanks to all the people who have helped make Nitrogen great, including:
</p>
<ul>
<li>
Rusty Klophaus (@rklophaus)
</li>
<li>
Chris Williams (@voodootikigod)
</li>
<li>
Joel Reymont (@wagerlabs)
</li>
<li>
Tom McNulty
</li>
<li>
Martin Scholl (@zeit_geist)
</li>
<li>
Dave Peticolas
</li>
<li>
Jon Gretar Borgthorsson (@jongretar)
</li>
<li>
Dan Bravender (@dbravender)
</li>
<li>
Taavi Talvik
</li>
<li>
Torbjorn Tornkvist (@kruskakli)
</li>
<li>
Marius A. Eriksen (@marius)
</li>
<li>
Michael Mullis
</li>
<li>
John Dragos
</li>
<li>
Benjamin Nortier (@bjnortier)
</li>
<li>
Jay Doane
</li>
<li>
Robert Schonberger
</li>
<li>
Yurii Rashkovskii (@yrashk)
</li>
<li>
Ville Koivula

</li>
</ul>

<p>Roughly sorted by date of contribution. Send your twitter handles to @rklophaus
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus
<a href="mailto:rklophaus@rklophaus-mac2">&lt;rklophaus@rklophaus-mac2&gt;</a>
</p>
<p class="date"> Date: 2010-03-03 07:48:51 EST</p>
<p class="creator">HTML generated by org-mode 6.33f in emacs 22</p>
</div>
</div>
</body>
</html>
